Repository: Bloomy3D2/StepCounter
Catalog: ChallengeApp/ChallengeApp/*.lproj/Localizable.strings
Languages: ru

# common.cancel
source: Cancel
ru: Отмена

# common.done
source: Done
ru: Готово

# common.close
source: Close
ru: Закрыть

# common.yes
source: Yes
ru: Да

# common.no
source: No
ru: Нет

# common.delete
source: Delete
ru: Удалить

# common.save
source: Save
ru: Сохранить

# nav.challenges
source: Challenges
ru: Челленджи

# nav.my_progress
source: My Progress
ru: Мой прогресс

# nav.create
source: Create
ru: Создать

# nav.history
source: History
ru: История

# nav.profile
source: Profile
ru: Профиль

# nav.active_challenges
source: Active Challenges
ru: Активные челленджи

# splash.title
source: Bet on Yourself
ru: Ставка на себя

# splash.subtitle
source: Failed — you pay. Completed — you take the money.
ru: Сорвался — платишь. Выдержал — забираешь деньги.

# splash.start
source: Start
ru: Начать

# challenge.join
source: Join for %@
ru: Войти за %@

# challenge.you_participate
source: You are participating
ru: Вы участвуете

# challenge.completed
source: Completed
ru: Завершено

# challenge.failed
source: Failed
ru: Провалено

# challenge.duration
source: Duration: %d days
ru: Длительность: %d дней

# challenge.entry_fee
source: Entry:
ru: Вход:

# challenge.service_fee
source: Service fee:
ru: Комиссия сервиса:

# challenge.prize_pool
source: Prize pool is divided among winners
ru: Призовой фонд делится между победителями

# challenge.conditions
source: Conditions
ru: Условия

# challenge.money
source: Money
ru: Деньги

# challenge.participants
source: Participants
ru: Участники

# profile.balance
source: Balance: %.2f ₽
ru: Баланс: %.2f ₽

# profile.honest_streak
source: Honest streak:
ru: Честная серия:

# profile.honest_streak_days
source: %d days
ru: %d дней

# profile.deposit
source: Deposit
ru: Пополнить баланс

# profile.withdraw
source: Withdraw
ru: Вывод средств

# profile.transaction_history
source: Transaction History
ru: История транзакций

# profile.no_transactions
source: No transactions yet
ru: Пока нет транзакций

# profile.rules
source: Rules
ru: Правила

# profile.support
source: Support
ru: Поддержка

# profile.clear_data
source: Clear Local Data
ru: Сбросить локальные данные

# profile.delete_account
source: Delete Account
ru: Удалить аккаунт

# profile.logout
source: Logout
ru: Выйти

# profile.available
source: Available
ru: Доступно

# profile.on_verification
source: Under verification
ru: Средства проходят проверку

# profile.pending_withdrawal
source: Pending withdrawal
ru: Ожидает вывода

# profile.available_for_withdrawal
source: Available for withdrawal
ru: Доступно для вывода

# profile.min_withdrawal
source: Minimum withdrawal: %d ₽
ru: Минимальная сумма вывода: %d ₽

# profile.min_amount
source: Minimum amount: %d ₽
ru: Минимальная сумма: %d ₽

# profile.withdrawal_request_created
source: Withdrawal request for %@ ₽ created. Funds will arrive within 1-3 business days.
ru: Заявка на вывод %@ ₽ создана. Средства поступят в течение 1-3 рабочих дней.

# profile.deposit_success
source: Balance successfully topped up by %@ ₽
ru: Баланс успешно пополнен на %@ ₽

# progress.title
source: My Progress
ru: Мой прогресс

# progress.total_stats
source: Total Statistics
ru: Общая статистика

# progress.win_rate
source: Win Rate
ru: Процент побед

# progress.lost
source: Lost
ru: Потеряно

# progress.earned
source: Earned
ru: Заработано

# progress.my_challenges
source: My Challenges
ru: Мои челленджи

# progress.no_challenges
source: You are not participating in any challenges yet
ru: Вы ещё не участвуете в челленджах

# progress.day_of
source: Day %d of %d
ru: День %d из %d

# progress.victory
source: Victory
ru: Победа

# progress.failure
source: Failure
ru: Провал

# progress.active
source: Active
ru: Активен

# progress.load_more
source: Load more
ru: Посмотреть еще

# victory.title
source: You made it to the end
ru: Вы дошли до конца

# victory.earned
source: You earned
ru: Вы заработали

# victory.winners
source: %d people made it to the end
ru: %d человек дошло до конца

# victory.withdraw
source: Withdraw money
ru: Вывести деньги

# victory.next_challenge
source: Next Challenge
ru: Следующий челлендж

# quickstart.title
source: Quick Start
ru: Быстрый старт

# quickstart.subtitle
source: Start with a simple 1-day challenge
ru: Начните с простого челленджа на 1 день

# quickstart.start_for
source: Start for %d ₽
ru: Начать за %d ₽

# quickstart.choose_other
source: Choose Another
ru: Выбрать другой

# alert.error
source: Error
ru: Ошибка

# alert.delete_account.title
source: Delete Account?
ru: Удалить аккаунт?

# alert.delete_account.message
source: This action cannot be undone. All your data will be deleted.
ru: Это действие нельзя отменить. Все ваши данные будут удалены.

# alert.clear_data.title
source: Clear Local Data?
ru: Сбросить локальные данные?

# alert.clear_data.message
source: This will delete all local challenges. Data will be reloaded from the server.
ru: Это удалит все локальные челленджи. Данные будут загружены заново с сервера.

# language.title
source: Language
ru: Язык

# language.select
source: Select Language
ru: Выберите язык

# active.day_of
source: Day %d of %d
ru: День %d из %d

# active.time_until_end
source: Time until end of day
ru: До конца дня

# active.excellent_tomorrow
source: Excellent. We'll continue tomorrow.
ru: Отлично. Завтра продолжим.

# active.complete
source: Completed
ru: Выполнил

# active.fail
source: Failed
ru: Провалился

# active.remaining_participants
source: Remaining participants:
ru: Осталось участников:

# active.completed_today
source: Completed today:
ru: Выполнило сегодня:

# active.dropped_today
source: Dropped today:
ru: Сегодня выбыло:

# active.no_active
source: No active challenges
ru: Нет активных челленджей

# active.confirm_title
source: Confirmation
ru: Подтверждение

# active.confirm_cancel
source: Cancel
ru: Отмена

# active.confirm_confirm
source: Confirm
ru: Подтвердить

# active.confirm_message
source: Are you sure? Money will not be refunded.
ru: Вы уверены? Деньги не будут возвращены.

# active.error_title
source: Error
ru: Ошибка

# active.error_complete
source: Failed to mark completion. Please try again.
ru: Не удалось отметить выполнение. Попробуйте ещё раз.

# active.error_fail
source: Failed to record failure. Please try again.
ru: Не удалось зафиксировать провал. Попробуйте ещё раз.

# active.progress_title
source: My Progress
ru: Мой прогресс

# stats.total_stats
source: Total Statistics
ru: Общая статистика

# stats.participations
source: Participations
ru: Участий

# stats.wins
source: Wins
ru: Побед

# stats.failures
source: Failures
ru: Провалов

# stats.earned
source: Earned
ru: Заработано

# stats.lost
source: Lost
ru: Потеряно

# stats.win_rate
source: Win Rate
ru: Процент побед

# stats.my_challenges
source: My Challenges
ru: Мои челленджи

# stats.no_challenges
source: You are not participating in any challenges yet
ru: Вы ещё не участвуете в челленджах

# stats.challenge_number
source: Challenge #%@
ru: Челлендж #%@

# stats.day
source: Day
ru: День

# stats.victory
source: Victory
ru: Победа

# stats.failure
source: Failure
ru: Провал

# stats.active
source: Active
ru: Активен

# failure.you_dropped
source: You dropped out
ru: Вы выбыли

# failure.conditions_not_met
source: You did not meet the conditions today.
ru: Сегодня вы не выполнили условия.

# failure.money_not_refunded
source: Money will not be refunded.
ru: Деньги не возвращаются.

# failure.view_other
source: View other challenges
ru: Посмотреть другие челленджи

# failure.wait_next_round
source: Wait for the next round to try again
ru: Дождитесь следующего раунда, чтобы попробовать снова

# common.coming_soon
source: Coming Soon
ru: Скоро

# detail.start_in
source: Starts in
ru: Старт через

# detail.start_date
source: Start date
ru: Дата старта

# detail.start_time
source: at %@
ru: в %@

# detail.conditions
source: Conditions
ru: Условия

# detail.rules_loading
source: Loading rules...
ru: Правила загружаются...

# detail.what_if_fail
source: What happens if you fail?
ru: Что будет, если ты сорвешься?

# detail.money_not_refunded
source: Money will not be refunded
ru: Деньги не возвращаются

# detail.service_fee_percent
source: Service fee — %d%%
ru: Комиссия сервиса — %d%%

# detail.money
source: Money
ru: Деньги

# detail.entry
source: Entry:
ru: Вход:

# detail.service_fee
source: Service fee:
ru: Комиссия сервиса:

# detail.prize_pool_info
source: Prize pool is divided among winners
ru: Призовой фонд делится между победителями

# detail.join_for
source: Join for %@
ru: Войти за %@

# detail.you_participate
source: You are participating in this challenge
ru: Вы участвуете в этом челлендже

# detail.go_to_challenge
source: Go to challenge
ru: Перейти к челленджу

# detail.you_won
source: You won this challenge!
ru: Вы выиграли этот челлендж!

# detail.you_dropped
source: You dropped out of this challenge
ru: Вы выбыли из этого челленджа

# detail.wait_next_round
source: Wait for the next round to try again
ru: Дождитесь следующего раунда, чтобы попробовать снова

# detail.challenge_ended
source: Challenge has ended
ru: Челлендж завершен

# payment.pay_apple
source: Pay with Apple Pay
ru: Оплатить через Apple Pay

# payment.pay_card
source: Pay %@
ru: Оплатить %@

# payment.pay_sbp
source: Pay via SBP
ru: Оплатить через СБП

# payment.duration_days
source: Duration: %d days
ru: Длительность: %d дней

# payment.amount_to_pay
source: Amount to pay
ru: Сумма к оплате

# payment.rules
source: Rules
ru: Правила

# payment.error
source: Error
ru: Ошибка

source: Payment method
ru: Способ оплаты

# payment.card
source: Bank card
ru: Банковская карта

# payment.sbp
source: SBP (Fast Payment System)
ru: СБП (Система быстрых платежей)

# payment.card_details
source: Card details
ru: Данные карты

# payment.card_number
source: Card number
ru: Номер карты

# payment.expiry
source: Expiry date
ru: Срок действия

# payment.cardholder
source: Cardholder name
ru: Имя держателя карты

# payment.receipt_email
source: Email for receipt
ru: Email для чека

# payment.email_valid
source: Email is valid
ru: Email корректен

# payment.email_receipt_info
source: A receipt will be sent to this email
ru: На этот email будет отправлен чек об оплате

# payment.email_required_title
source: Enter your email
ru: Укажите электронную почту

# payment.email_required_description
source: Email is required to receive a payment receipt.
ru: Почта необходима для получения чека об оплате покупки.

# payment.confirm
source: Confirm
ru: Подтвердить

# payment.email_invalid
source: Please enter a valid email
ru: Введите корректный email

# payment.sbp_payment
source: SBP Payment
ru: Оплата через СБП

# payment.sbp_info
source: After clicking the payment button, you will be redirected to your bank's app to confirm the payment.
ru: После нажатия кнопки оплаты вы будете перенаправлены в приложение вашего банка для подтверждения платежа.

# payment.terms_agree
source: I understand the rules and agree to the terms. Money will not be refunded if the challenge fails.
ru: Я понимаю правила и согласен с условиями. Деньги не возвращаются при провале челленджа.

# payment.got_it
source: Got it
ru: Понятно

# payment.excellent
source: Excellent!
ru: Отлично!

# payment.processing
source: Processing payment
ru: Обработка платежа

# payment.processing_wait
source: Please wait...
ru: Пожалуйста, подождите...

# auth.or
source: or
ru: или

# auth.sign_in_apple
source: Sign in with Apple
ru: Войти через Apple

# auth.sign_up
source: Sign Up
ru: Зарегистрироваться

# auth.sign_in
source: Sign In
ru: Войти

# auth.already_have_account
source: Already have an account?
ru: Уже есть аккаунт?

# auth.no_account
source: Don't have an account?
ru: Нет аккаунта?

# victory.made_it
source: You made it to the end
ru: Вы дошли до конца

# victory.you_earned
source: You earned
ru: Вы заработали

# victory.winners_count
source: %d people made it to the end
ru: %d человек дошло до конца

# victory.withdraw_money
source: Withdraw money
ru: Вывести деньги

# language.select_interface
source: Select interface language
ru: Выберите язык интерфейса

# quickstart.ready
source: Ready to start?
ru: Готовы начать?

# quickstart.try_first
source: Try your first challenge
ru: Попробуйте первый челлендж

# quickstart.first_challenge
source: First Challenge
ru: Первый челлендж

# quickstart.duration_label
source: Duration:
ru: Длительность:

# quickstart.day
source: day
ru: день

# quickstart.days
source: days
ru: дней

# quickstart.stake
source: Stake:
ru: Ставка:

# quickstart.category
source: Category:
ru: Категория:

# onboarding.short_challenges
source: Short Challenges
ru: Короткие челленджи

# onboarding.on_discipline
source: on Discipline
ru: на дисциплину

# onboarding.money_motivates
source: Money enhances motivation
ru: Деньги усиливают мотивацию

# onboarding.next
source: Next
ru: Дальше

# onboarding.how_it_works
source: How It Works
ru: Как это работает

# onboarding.step_join
source: Join a challenge
ru: Входишь в челлендж

# onboarding.step_pay
source: Pay entry fee
ru: Платишь вход

# onboarding.step_complete
source: Complete → Earn
ru: Выполняешь → зарабатываешь

# onboarding.step_fail
source: Fail → Lose
ru: Не выполняешь → теряешь

# onboarding.not_for_everyone
source: This is not for everyone.
ru: Это не для всех.

# onboarding.no_excuses
source: No excuses here.
ru: Здесь нет оправданий.

# onboarding.start
source: Start
ru: Начать

# onboarding.skip
source: Skip
ru: Пропустить

# profile.honest_streak_label
source: Honest streak:
ru: Честная серия:

# profile.days
source: days
ru: дней

# profile.deposit_balance
source: Deposit
ru: Пополнить баланс

# profile.transaction_history_title
source: Transaction History
ru: История транзакций

# profile.no_transactions_yet
source: No transactions yet
ru: Пока нет транзакций

# profile.time_remaining
source: Time remaining: %@
ru: Осталось: %@

# profile.pending_withdrawal_label
source: Pending withdrawal
ru: Ожидает вывода

# profile.min_withdrawal_amount
source: Minimum withdrawal: %d ₽
ru: Минимальная сумма вывода: %d ₽

# profile.quick_selection
source: Quick Selection
ru: Быстрый выбор

# profile.all
source: All
ru: Все

# profile.or_enter_amount
source: Enter amount
ru: Введите сумму

# profile.insufficient_funds
source: Insufficient funds
ru: Недостаточно средств

# profile.min_amount_label
source: Minimum amount: %d ₽
ru: Минимальная сумма: %d ₽

# profile.withdraw_method
source: Withdrawal Method
ru: Способ вывода

# profile.bank_card
source: Bank card
ru: Банковская карта

# profile.bank_account
source: Bank account
ru: Банковский счет

# profile.sbp_phone
source: SBP (to phone number)
ru: СБП (на номер телефона)

# profile.card_number
source: Card number
ru: Номер карты

# profile.account_number
source: Account number (20 digits)
ru: Номер счета (20 цифр)

# profile.phone_number
source: Phone number
ru: Номер телефона

# profile.funds_arrival
source: Funds will arrive within 1-3 business days
ru: Средства поступят в течение 1-3 рабочих дней

# profile.withdraw_funds
source: Withdraw funds
ru: Вывести средства

# profile.rules_title
source: Rules
ru: Правила

# profile.rule_1
source: 1. Mark challenge completion every day
ru: 1. Каждый день отмечай выполнение челленджа

# profile.rule_2
source: 2. No mark = automatic dropout
ru: 2. Нет отметки = автоматический вылет

# profile.rule_3
source: 3. Money is not refunded if you fail
ru: 3. Деньги не возвращаются при провале

# profile.rule_4
source: 4. Prize pool is divided among all winners
ru: 4. Призовой фонд делится между всеми победителями

# profile.current_balance
source: Current Balance
ru: Текущий баланс

# profile.deposit_success_amount
source: Balance successfully topped up by %@ ₽
ru: Баланс успешно пополнен на %@ ₽

# profile.withdrawal_created_title
source: Request Created!
ru: Заявка создана!

# profile.tx_deposit
source: Deposit
ru: Пополнение

# profile.tx_entry_fee
source: Challenge entry
ru: Вход в челлендж

# profile.tx_withdrawal
source: Withdrawal
ru: Вывод

# profile.tx_payout
source: Payout
ru: Выплата

# error.auth_required
source: Authentication required
ru: Требуется авторизация

# error.invalid_amount
source: Invalid amount
ru: Неверная сумма

# error.enter_valid_amount
source: Enter a valid amount
ru: Введите корректную сумму

# error.already_participating
source: You are already participating in this challenge
ru: Вы уже участвуете в этом челлендже

# error.login_required
source: You need to log in to join a challenge
ru: Для вступления в челлендж необходимо войти в приложение

# error.payment_success_join_failed
source: Payment succeeded, but failed to join challenge. Funds have been refunded.
ru: Оплата прошла, но не удалось вступить в челлендж. Средства возвращены.

# error.payment_success_join_failed_auto
source: Payment succeeded, but failed to join challenge. Funds will be refunded automatically. If the problem persists, contact support.
ru: Оплата прошла, но не удалось вступить в челлендж. Средства будут возвращены автоматически. Если проблема сохраняется, обратитесь в поддержку.

# error.try_again_support
source: %@ Please try again. If the problem persists, contact support.
ru: %@ Попробуйте еще раз. Если проблема сохраняется, обратитесь в поддержку.

# auth.tagline
source: Prove yourself. Or pay.
ru: Докажи себе. Или заплати.

# auth.name
source: Name
ru: Имя

# auth.password
source: Password
ru: Пароль
